#include<stdio.h>
int main()//操作符
{
	char a = 3;
	//0000 0000 0000 0000 0000 0000     0000 0011   int类型存到char只能存一个字节

	char b = 127;
	//0000 0000 0000 0000 0000 0000     0111 1111   int类型存到char只能存一个字节
	//0111 1111
	char c = a + b;
	//0000 0000 0000 0000 0000 0000     0000 0011
	//0000 0000 0000 0000 0000 0000     0111 1111
	//1111 1111 1111 1111 1111 1111     1000 0010   ——补码  char只能存一个字节 高位补1
	//1111 1111 1111 1111 1111 1111     1000 0001   char没有达到int大小就会发生整形提升 这是负数就需要求源码
	//1000 0000 0000 0000 0000 0000     1111 1110  -----源码 ——126
	//char没有达到int大小就会发生整形提升

	printf("%d\n",c);

	int v = 3;
	float n = 4.5f;
	int y = v + n;
	printf("%d\n", y);


	int d = 5;
	int e = d + a * 2;//乘号优先
	int f = d + a + 3;
	printf("%d %d\n", e, f);


	return 0;

}